<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');
class multi_function {
	public function myanmar_number($_num) {
		$_temp=" ";
		$_number= array('၀','၁','၂','၃','၄','၅','၆','၇','၈','၉');
		for ($i = 0; $i < strlen($_num); $i++){
		$_temp .= $_number[substr($_num,$i,1)];
		}
		return $_temp;
	}
	
	public function english_number($_str) {
		$_search = array("၀","၁","၂","၃","၄","၅","၆","၇","၈","၉");
		$_replace = array('0','1','2','3','4','5','6','7','8','9');
		return str_replace($_search, $_replace, $_str);
	}
	
	public function month_number($_str) {
		$_search = array("January","February","March","April","May","June","July","Augest","September","October","November","December");
		$_replace = array('01','02','03','04','05','06','07','08','09','10','11','12');
		return str_replace($_search, $_replace, $_str);
	}
	
	public function month_myanmar_number1($_str) {
		$_search = array('01','02','03','04','05','06','07','08','09','10','11','12');
		$_replace = array('ဇန္န၀ါရီ','ေဖေဖာ္၀ါရီ','မတ္','ဧၿပီ','ေမ','ဇြန္','ဇူလိုင္','ၾသဂုတ္','စက္တင္ဘာ','ေအာက္တိုဘာ','ႏို၀င္ဘာ','ဒီဇင္ဘာ');
		return str_replace($_search, $_replace, $_str);
	}
	
	public function month_myanmar_number2($_str) {
		$_search = array('ဇန္န၀ါရီ','ေဖေဖာ္၀ါရီ','မတ္','ဧၿပီ','ေမ','ဇြန္','ဇူလိုင္','ၾသဂုတ္','စက္တင္ဘာ','ေအာက္တိုဘာ','ႏို၀င္ဘာ','ဒီဇင္ဘာ');
		$_replace = array("01","02","03","04","05","06","07","08","09","10","11","12");		
		return str_replace($_search, $_replace, $_str);
	}
	
	public function year_myanmar_number($_str) {
		$_search = array(
		"1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980",
		"1981","1982","1983","1984","1985","1986","1987","1988","1989","1990",
		"1991","1992","1993","1994","1995","1996","1997","1998","1999","2000",
		"2001","2002","2003","2004","2005","2006","2007","2008","2009","2010",
		"2011","2012","2013","2014","2015","2016","2017","2018","2019","2020",
		"2021","2022","2023","2024","2025","2026","2027","2028","2029","2030",
		"2031","2032","2033","2034","2035","2036","2037","2038","2039","2040",
		"2041","2042","2043","2044","2045","2046","2047","2048","2049","2050");
		$_replace = array(
		'၁၉၇၀','၁၉၇၁','၁၉၇၂','၁၉၇၃','၁၉၇၄','၁၉၇၅','၁၉၇၆','၁၉၇၇','၁၉၇၈','၁၉၇၉','၁၉၈၀',
		'၁၉၈၁','၁၉၈၂','၁၉၈၃','၁၉၈၄','၁၉၈၅','၁၉၈၆','၁၉၈၇','၁၉၈၈','၁၉၈၉','၁၉၉၀',
		'၁၉၉၁','၁၉၉၂','၁၉၉၃','၁၉၉၄','၁၉၉၅','၁၉၉၆','၁၉၉၇','၁၉၉၈','၁၉၉၉','၂၀၀၀',
		'၂၀၀၁','၂၀၀၂','၂၀၀၃','၂၀၀၄','၂၀၀၅','၂၀၀၆','၂၀၀၇','၂၀၀၈','၂၀၀၉','၂၀၁၀',
		'၂၀၁၁','၂၀၁၂','၂၀၁၃','၂၀၁၄','၂၀၁၅','၂၀၁၆','၂၀၁၇','၂၀၁၈','၂၀၁၉','၂၀၂၀',
		'၂၀၂၁','၂၀၂၂','၂၀၂၃','၂၀၂၄','၂၀၂၅','၂၀၂၆','၂၀၂၇','၂၀၂၈','၂၀၂၉','၂၀၃၀',
		'၂၀၃၁','၂၀၃၂','၂၀၃၃','၂၀၃၄','၂၀၃၅','၂၀၃၆','၂၀၃၇','၂၀၃၈','၂၀၃၉','၂၀၄၀',
		'၂၀၄၁','၂၀၄၂','၂၀၄၃','၂၀၄၄','၂၀၄၅','၂၀၄၆','၂၀၄၇','၂၀၄၈','၂၀၄၉','၂၀၅၀');
		return str_replace($_search, $_replace, $_str);
	}	
}
