
					<div class="span-24 par_bg">
					<p class="span-22 p1 push-1 prepend-top">
						ျမန္မာ့ပညာေရးစနစ္ကို ျမန္မာႏုိင္ငံ ပညာေရး ၀န္ႀကီးဌာနမွ ျပဌာန္းထားပါသည္။ အဆင့္ျမင့္ပညာဦးစီးဌာန 
						(အထက္ျမန္မာျပည္) ႏွင့္ အဆင့္ျမင့္ပညာဦးစီးဌာန (ေအာက္ျမန္မာျပည္) စသည့္ ဌာန (၂) ခုျဖင့္၊
						အထက္ ျမန္မာျပည္ႏွင့္ ေအာက္ျမန္မာျပည္တြင္ အသက္ေမြး၀မ္းေက်ာင္း ေကာလိပ္၊ တကၠသိုလ္မ်ား ဖြင့္လွစ္ထားပါသည္။
						ရန္ကုန္ႏွင့္ မႏၲေလးတြင္ ရံုးခ်ဳပ္ တည္ရွိကာ ျမန္မာ့ပညာေရးစနစ္ကို အဂၤလန္ႏိုင္ငံ၏ ပညာေရးစနစ္အား အေျခခံ ဖြဲ႕စည္းထားပါသည္။ 
					</p>
					
					<p class="span-22 p1 push-1">
						လက္႐ွိ က်င့္သံုးေနေသာ ျမန္မာႏိုင္ငံ၏ ပညာေရးစနစ္သည္ ၁၀ တန္းေအာင္ၿပီးမွ တကၠသိုလ္ တက္ေရာက္ သင္ၾကားႏိုင္မည့္အဆင့္မွ 
						၁၂ တန္း ေအာင္မွသာ တကၠသိုလ္ကိုတက္ေရာက္ သင္ၾကားႏိုင္မည့္ “A level” ပညာေရး စနစ္သို႔ ျပန္ေျပာင္းရန္ စီစဥ္လ်က္ ႐ွိေၾကာင္း
						ျပည္နယ္ ပညာေရးမွဴးမ်ားထံမွ သိ႐ွိရပါသည္။ အဆိုပါ တကၠသိုလ္ဝင္ခြင့္ စာေမးပြဲကိုသီးသန္႔ သတ္မွတ္သည့္ ပံုစံႏွင့္ ပတ္သက္၍ ပညာေရး 
						သုေတသီ တစ္ဦးျဖစ္ သူ ေဒါက္တာ စိုးဝင္းဦးက “ကမၻာမွာ လက္႐ွိ က်င့္သံုးေနတဲ့ ပညာေရး စနစ္က Grade 12 system နဲ႕ သြားပါတယ္။ 
						Grade “10” အထိကို “O level” လို႔ ေခၚၿပီး Grade 12 အထိကို “A Level” လို႔ သတ္မွတ္ ေခၚဆိုပါတယ္။ ႏိုင္ငံတကာ အဆင့္မွာ “A Level” ေအာင္ျမင္ၿပီးမွ
						တကၠသိုလ္ ပညာကို တက္ေရာက္ သင္ၾကားခြင့္႐ွိတယ္။ Grade 12 system ပညာေရး စနစ္မွာေတာ့ သူငယ္တန္း ေအာင္ျမင္ၿပီးမွ Grade 1 ကို တက္ေရာက္ သင္ၾကားႏိုင္မွာ ျဖစ္တယ္” လို႔ ႐ွင္းျပ ပါသည္။

					</p>
					
					<p class="span-22 p1 push-1">
						အနာဂတ္ ႏုိင္ငံေတာ္ကို တာဝန္ယူ ေဆာင္ရြက္ၾကရမည့္ မ်ိဳးဆက္သစ္ လူငယ္ အပါအဝင္ တစ္ႏုိင္ငံလံုး၏ လူ႔စြမ္းအား 
						အရင္းအျမစ္ ဖြံ႕ၿဖိဳးတိုးတက္ေရး အတြက္ ပညာေရး ျမင့္မားေရးသည္ အေျခခံက်သည့္ လိုအပ္ခ်က္ ျဖစ္ေသာေၾကာင့္ 
						ပညာေရး က႑ကို ႏုိင္ငံတကာ အဆင့္မီ တိုးတက္ ျမင့္မားလာေအာင္ ေဆာင္ရြက္သြားမည္ ျဖစ္ၿပီး လူ႔စြမ္းအား အရင္းအျမစ္ 
						ဖြံ႕ၿဖိဳး တိုးတက္ေရးကိုလည္း အေလးထား အားေပး ေဆာင္ရြက္သြားမည္ ျဖစ္ပါသည္။ ယင္းကဲ့သို႔ ေဆာင္ရြက္ရာတြင္ ကုလသမဂၢ 
						အပါအဝင္ ႏိုင္ငံတကာ အဖြဲ႕အစည္းမ်ား၊ ႏုိင္ငံတကာ အစိုးရ မဟုတ္ေသာ အဖြဲ႕အစည္းမ်ား၊ ျပည္တြင္း လူမႈေရး အသင္းအဖဲြ႕မ်ားႏွင့္လည္း 
						ပူးေပါင္း ေဆာင္ရြက္သြားမည္ ျဖစ္ေၾကာင္း သိရသည္။ ႏိုင္ငံကို ေခတ္မီ၊ ဖြံ႕ၿဖိဳး၊ တိုးတက္ေသာ ဒီမိုကေရစီ ႏုိင္ငံေတာ္သစ္ တည္ေဆာက္ရာတြင္ ထူးခၽြန္ေသာ 
						လူ႔စြမ္းအား အရင္းအျမစ္ျဖစ္သည့္ အသိပညာရွင္၊ အတတ္ပညာရွင္ အမ်ားႀကီး လိုအပ္ပါသည္။ ယခု ပညာေရး က႑တြင္ အထူး ဖြံ႕ၿဖိဳးေရး ေဒသႀကီး ၂၄ ခု 
						သတ္မွတ္ၿပီး ျပည္နယ္ႏွင့္ တုိင္းေဒသႀကီးအလုိက္ အဆင့္ျမင့္ ပညာမ်ားကို မိမိေဒသ အတြင္းမွာပဲ သင္ယူႏုိင္ေအာင္ တကၠသိုလ္၊ ေကာလိပ္မ်ား ရွိေနၿပီ ျဖစ္ပါသည္။
						အေျခခံပညာ အဆင့္မွာလည္း ေက်းလက္ေဒသမ်ားတြင္ စာသင္ေက်ာင္းေပါင္းမ်ားစြာ ရွိေနၿပီ ျဖစ္ပါသည္။ 

					</p>
					</div>